In [1]:
import pandas as pd

In [2]:
friends = [{'name' : 'John', 'age' : 20, 'job' : 'student'},
           {'name' : 'Jenny', 'age' : 30, 'job' : None},
           {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}
          ]

In [3]:
df = pd.DataFrame(friends)

In [4]:
df = df[['name','age','job']]

In [6]:
df.head()

    name  age      job
0   John   20  student
1  Jenny   30     None
2   Nate   30  teacher

In [7]:
df.to_csv('friends.csv', index = True, header = True) # 데이터프레임을 파일로 저장하기
#index = True, header = True는 디폴트 값.

In [11]:
df.to_csv('friends.csv', index = False, header = False)
#인덱스와 헤더 없이 데이터만 저장

In [ ]:

#None값은 csv파일 상에서 빈 공간으로 나타난다. 이를 다른거